<template><div><h1 id="用户帮助文档" tabindex="-1"><a class="header-anchor" href="#用户帮助文档"><span>用户帮助文档</span></a></h1>
<h2 id="主页" tabindex="-1"><a class="header-anchor" href="#主页"><span>主页</span></a></h2>
<p>在主页面里，可通过点击 Getting Started 进入用户使用说明文档，
点击 Github repo 可进入代码仓库。</p>
<h2 id="单图片查看与测试" tabindex="-1"><a class="header-anchor" href="#单图片查看与测试"><span>单图片查看与测试</span></a></h2>
<p>该页面的核心内容由两部分组成，即图片展示区域和
按钮控制区域。可通过打开图片按钮选取一张图片进行展示，支持的图片格式包括
png、jpg、bmp、CR2、ARW。对于 CR2、ARW 两种 raw 格式的图片，系统会通过
pack_raw_bayer 函数，将单通道的 raw 格式的图片转换为 4 通道的 RGBG 图片，同
时通过 read_wb_ccm 函数，读取 raw 格式图片的白平衡参数 (wb) 和色彩校正矩阵
(ccm)，最后将 4 通道的 RGBG 图片、wb、ccm 作为 raw2rgb 函数的输入，得到 3 通
道的 RGB 图片。再将 3 通道的 RGB 图片转换为 PyQt 支持的 QImage 对象，即可在
图片展示区域显示 raw 格式的图片。png、jpg、bmp 格式的图片可通过 PyQt 提供的
QPixmap 类较为方便快捷地展示上述三种格式的图片，无需通过 RAW 格式图片复
杂的转换流程。</p>
<p>对于按钮控制区域，四个 PushButton 按钮和两个 QEditLine 文本显示框。打开图
片按钮控制图片展示区域的显示，开始测试按钮可启动测试程序，选择 GT(ground-
truth) 图片按钮可选择 GT 文件的路径，选择预训练模型按钮可切换不同的预训练模
型进行测试。两个 QEditLine 文本显示框即显示对应的 GT 文件路径和预训练模型路
径。设置好两个路径参数之后，可点击开始测试按钮将打开的图片输入测试网络，即
可在对应的输出路径下得到网络的输出结果，包括推理时间、PSNR、SSIM。考虑到
特殊情况下可能没有对应的 GT 图片，可以不设置 GT 文件路径，显然，也无法得到
对应的 PSNR、SSIM 测试结果。</p>
<h2 id="多图片测试配置" tabindex="-1"><a class="header-anchor" href="#多图片测试配置"><span>多图片测试配置</span></a></h2>
<p>该页面的核心内容由两部分组成，即配置参数编
辑区域和按钮控制区域。配置参数编辑区域只支持 json 格式的文本编辑，若出现非
json 格式的内容，无法进行后续正常的测试。该编辑区域可支持手动编辑，也可支持
通过按钮区域快速生成测试参数。编辑区域的纯文本内容通过 json.loads 方法转换为
dict 对象的，以便后续正常的传参流程。对于按钮控制区域，总共为 6 个按钮。可以通过 6 个按钮执行不同的功能操作。
这些按钮分别是导入 json、导出 json、开始测试、生成测试文件路径、选择 GT 文件
夹和选择预训练模型。</p>
<h2 id="结果统计" tabindex="-1"><a class="header-anchor" href="#结果统计"><span>结果统计</span></a></h2>
<p>该页面的核心内容由两部分组成，即统计结果显示
界面和按钮控制区域。统计结果显示界面对 5 个字段进行统计，包括模型名称、图
片名称、推理时间、PSNR、SSIM。</p>
<p>按钮控制区域包括一个下拉选择列表和 5 个控制按钮。下拉选择按钮可选择上述 5 个字段，并通过点击结果排序按钮对显示区域的统计结果进行排序。其余四个按钮为从 json 导入结果、从文件夹导入结果、结果保存为 json、清除结果。</p>
<h2 id="设置" tabindex="-1"><a class="header-anchor" href="#设置"><span>设置</span></a></h2>
<p>可以选择添加文件夹，保存一些数据文件夹路径。可以
修改下载目录，即输出结果路径。同时提供个性化功能，包括云母效果 (窗口和表面
显示半透膜)，应用主题 (浅色、深色)，主题色 (默认颜色或者自定义颜色)，界面缩
放，语言切换 (中英文)。</p>
</div></template>


